x = 10
y = 20
z = x + y
print("The sum of x and y is:", z)
#直接使用
print("The sum of x and y is: %d" % z)
#使用%格式化方法
print("The sum of x and y is: {}".format(z))
#使用format方法
print(f"The sum of x and y is: {z}\n")
#使用f-string方法
#以上四種方法均可輸出變數z的值


x = eval(input("請輸入一個數字: "))
print("以下為不同格式的輸出:")
print(f"您輸入的數字是整數: {x:d}")
#整數
print(f"您輸入的數字是浮點數: {x:f}")
#浮點數
print(f"您輸入的數字是八進制: {x:o}")
#八進制
print(f"您輸入的數字是十六進制: {x:x}")
#十六進制
print(f"您輸入的數字是二進制: {x:b}\n")
#二進制
#以上六種方法均可輸出變數x的不同格式

print(f"您輸入的數字是指定寬度為10，右對齊: {x:10d}")
#指定寬度為10，右對齊
print(f"您輸入的數字是指定寬度為10，左對齊: {x:<10d}")
#指定寬度為10，左對齊
print(f"您輸入的數字是指定寬度為10，居中對齊: {x:-10d}")
#指定寬度為10，居中對齊
print(f"您輸入的數字是指定寬度為10，顯示正負號: {x:+10d}")
#指定寬度為10，顯示正負號
print(f"您輸入的數字是指定寬度為10，前面補0: {x:0>10d}")
#指定寬度為10，前面補0
print(f"您輸入的數字是指定寬度為10，前面補*: {x:*>10d}\n")
#指定寬度為10，前面補*
#以上五種方法均可輸出變數x的不同對齊和填充格式


y = float(input("請輸入浮點數: "))
print(f"您輸入的數字是小數點後保留2位: {y:.2f}")
#小數點後保留2位